In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'Names': ['Alice', 'Bob', 'Charlie', 'Brian', 'David']})

filtered_df = df[df['Names'].str.contains(r'^[AB]', regex=True)]
print(filtered_df)

   Names
0  Alice
1    Bob
3  Brian

In [3]:
df

     Names
0    Alice
1      Bob
2  Charlie
3    Brian
4    David

In [10]:
df = pd.DataFrame({'Full Name': ['Alice Cooper', 'Bob Marley', 'Charlie Chaplin']})

df[['First Name', 'Last Name']] = df['Full Name'].str.extract(r'(\w+) (\w+)')
df

         Full Name First Name Last Name
0     Alice Cooper      Alice    Cooper
1       Bob Marley        Bob    Marley
2  Charlie Chaplin    Charlie   Chaplin

# Write a  Pandas program to capitalize all the string values of specified columns of a given DataFrame.

In [15]:
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
df

      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0

In [16]:
df['name'] = df['name'].str.capitalize()
df

      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

In [18]:
df = pd.DataFrame({'Emails': ['alice@gmail.com', 'bob@yahoo.com', 'charlie@outlook.com']})

df['Contains "gmail"'] = df['Emails'].str.contains(r'gmail')

df

                Emails  Contains "gmail"
0      alice@gmail.com              True
1        bob@yahoo.com             False
2  charlie@outlook.com             False

In [19]:
df['Extract Domain'] = df['Emails'].str.extract(r'@(\w+)\.')
df

                Emails  Contains "gmail" Extract Domain
0      alice@gmail.com              True          gmail
1        bob@yahoo.com             False          yahoo
2  charlie@outlook.com             False        outlook

In [20]:
df['Masked Email'] = df['Emails'].str.replace(r'@\w+', '@*****', regex=True)
df

                Emails  Contains "gmail" Extract Domain       Masked Email
0      alice@gmail.com              True          gmail    alice@*****.com
1        bob@yahoo.com             False          yahoo      bob@*****.com
2  charlie@outlook.com             False        outlook  charlie@*****.com